Autodesk.Revit.UI.FileDialog.IsValidFilterString(System.String)
Determines if the input string is acceptable as input for a FileDialog filter string.
filterString:
The filter string.
Returns:
True of the filter string meets the minimal requirements to be a valid filter string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.FileDialog.DefaultFilterEntry
The default entry (from the filter) to be selected in the dialog.
This string value should be found in the string that makes up the right hand side of the filter entry.
If a match is found, that entry from the filter will be shown by default when the dialog is shown.
If this value is not set, or it cannot match any of the entries in the filter,
it will be ignored, and the first entry in the filter will be used instead.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: defaultFilterEntry cannot include prohibited unprintable characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.FileDialog.Title
The title to show on the dialog.
If not set, a default title will be used for the dialog.  For open, this will be something similar to
"Select File" and for save, "Save As".
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: title cannot include prohibited unprintable characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.FileDialog.Filter
The filter string representing a collection of extensions allowed by the dialog.
The required format for this string is a collection of one or more filter labels (representing the text
the user will see in the Files of Type pulldown) plus an associated file matching string separated by the
'|' character.
Some examples of valid filter strings:
"Revit Files (*.rvt)|*.rvt"Revit Projects (*.rvt)|*.rvt|Revit Families (*.rfa)|*.rfa""All files|*.*""All Revit files (*.rvt, *.rfa, *.rte, *.rft)|*.rvt;*.rfa;*.rte;*.rft"
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input filter string does not meet the minimal requirements for a valid filter string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017